var LAreaData = [{
    "id": "2",
    "name": "温州市",
    "child": [
        {
            "id": "21",
            "name": "鹿城区",
            "child": [{
                "id": "211",
                "name": "五马街道"
            }, {
                "id": "212",
                "name": "七都街道"
            }, {
                "id": "213",
                "name": "滨江街道"
            }, {
                "id": "214",
                "name": "南汇街道"
            },{
                "id": "215",
                "name": "松台街道"
            },{
                "id": "216",
                "name": "双屿街道"
            },{
                "id": "217",
                "name": "仰义街道"
            },{
                "id": "218",
                "name": "大南街道"
            },{
                "id": "219",
                "name": "蒲鞋市街道"
            },{
                "id": "2110",
                "name": "南郊街道"
            },{
                "id": "2111",
                "name": "广化街道"
            },{
                "id": "2112",
                "name": "丰门街道"
            },{
                "id": "2113",
                "name": "藤桥镇"
            },{
                "id": "2114",
                "name": "山福镇"
            }]
        },
        {
            "id": "22",
            "name": "龙湾区",
            "child": [{
                "id": "221",
                "name": "永中街道"
            }, {
                "id": "222",
                "name": "蒲州街道"
            }, {
                "id": "223",
                "name": "海滨街道"
            }, {
                "id": "224",
                "name": "永兴街道"
            },{
                "id": "225",
                "name": "状元街道"
            },{
                "id": "226",
                "name": "瑶溪街道"
            }]
        },
        {
            "id": "23",
            "name": "瓯海区",
            "child": [{
                "id": "231",
                "name": "景山街道"
            }, {
                "id": "232",
                "name": "梧田街道"
            }, {
                "id": "233",
                "name": "南白象街道"
            }, {
                "id": "234",
                "name": "茶山街道"
            },{
                "id": "235",
                "name": "娄桥街道"
            },{
                "id": "236",
                "name": "新桥街道"
            },{
                "id": "237",
                "name": "三垟街道"
            },{
                "id": "238",
                "name": "瞿溪街道"
            },{
                "id": "239",
                "name": "郭溪街道"
            },{
                "id": "2311",
                "name": "潘桥街道"
            },{
                "id": "2312",
                "name": "丽岙街道"
            },{
                "id": "2313",
                "name": "仙岩街道"
            },{
                "id": "2314",
                "name": "泽雅镇"
            }]
        },
        {
            "id": "24",
            "name": "洞头区",
            "child": [{
                "id": "241",
                "name": "北岙街道"
            }, {
                "id": "242",
                "name": "东屏街道"
            }, {
                "id": "243",
                "name": "元觉街道"
            }, {
                "id": "244",
                "name": "霓屿街道"
            }, {
                "id": "245",
                "name": "灵昆街道"
            }, {
                "id": "246",
                "name": "大门镇"
            }, {
                "id": "247",
                "name": "鹿西乡"
            }]
        },
        {
            "id": "25",
            "name": "温州经济技术开发区",
            "child": [{
                "id": "251",
                "name": "海城街道"
            }, {
                "id": "252",
                "name": "沙城街道"
            }, {
                "id": "253",
                "name": "天河街道"
            }, {
                "id": "254",
                "name": "星海街道"
            }]
        },
        {
            "id": "26",
            "name": "瑞安市",
            "child": [{
                "id": "261",
                "name": "安阳街道"
            }, {
                "id": "262",
                "name": "玉海街道"
            }, {
                "id": "263",
                "name": "锦湖街道"
            }, {
                "id": "264",
                "name": "东山街道"
            },{
                "id": "265",
                "name": "上望街道"
            },{
                "id": "266",
                "name": "莘塍街道"
            },{
                "id": "267",
                "name": "汀田街道"
            },{
                "id": "268",
                "name": "飞云街道"
            },{
                "id": "269",
                "name": "仙降街道"
            },{
                "id": "2611",
                "name": "南滨街道"
            },{
                "id": "2612",
                "name": "潘岱街道"
            },{
                "id": "2613",
                "name": "云周街道"
            },{
                "id": "2614",
                "name": "塘下镇"
            },{
                "id": "2615",
                "name": "马屿镇"
            },{
                "id": "2616",
                "name": "陶山镇"
            },{
                "id": "2617",
                "name": "湖岭镇"
            },{
                "id": "2618",
                "name": "高楼镇"
            },{
                "id": "2619",
                "name": "桐浦镇"
            },{
                "id": "2620",
                "name": "林川镇"
            },{
                "id": "2621",
                "name": "曹村镇"
            },{
                "id": "2622",
                "name": "平阳坑镇"
            },{
                "id": "2623",
                "name": "芳庄乡"
            },{
                "id": "2624",
                "name": "北麂乡"
            }]
        },
        {
            "id": "27",
            "name": "乐清市",
            "child": [{
                "id": "271",
                "name": "大荆镇"
            }, {
                "id": "272",
                "name": "仙溪镇"
            }, {
                "id": "273",
                "name": "雁荡镇"
            }, {
                "id": "274",
                "name": "芙蓉镇"
            },{
                "id": "275",
                "name": "清江镇"
            },{
                "id": "276",
                "name": "虹桥镇"
            },{
                "id": "277",
                "name": "淡溪镇"
            },{
                "id": "278",
                "name": "柳市镇"
            },{
                "id": "279",
                "name": "北白象镇"
            },{
                "id": "2711",
                "name": "湖雾镇"
            },{
                "id": "2712",
                "name": "南塘镇"
            },{
                "id": "2713",
                "name": "南岳镇"
            },{
                "id": "2714",
                "name": "蒲岐镇"
            },{
                "id": "2715",
                "name": "磐石镇"
            },{
                "id": "2716",
                "name": "智仁乡"
            },{
                "id": "2717",
                "name": "龙西乡"
            },{
                "id": "2718",
                "name": "岭底乡"
            },{
                "id": "2719",
                "name": "城东街道办事处"
            },{
                "id": "2720",
                "name": "乐成街道办事处"
            },{
                "id": "2721",
                "name": "城南街道办事处"
            },{
                "id": "2722",
                "name": "盐盆街道办事处"
            },{
                "id": "2723",
                "name": "翁垟街道办事处"
            },{
                "id": "2724",
                "name": "白石街道办事处"
            },{
                "id": "2725",
                "name": "石帆街道办事处"
            },{
                "id": "2726",
                "name": "天成街道办事处"
            }]
        },
        {
            "id": "28",
            "name": "永嘉县",
            "child": [{
                "id": "281",
                "name": "东城街道"
            }, {
                "id": "282",
                "name": "北城街道"
            }, {
                "id": "283",
                "name": "南城街道"
            }, {
                "id": "284",
                "name": "三江街道"
            },{
                "id": "285",
                "name": "黄田街道"
            },{
                "id": "286",
                "name": "乌牛街道"
            },{
                "id": "287",
                "name": "瓯北街道"
            },{
                "id": "288",
                "name": "桥头镇"
            },{
                "id": "289",
                "name": "桥下镇"
            },{
                "id": "2811",
                "name": "大若岩镇"
            },{
                "id": "2812",
                "name": "碧莲镇"
            },{
                "id": "2813",
                "name": "巽宅镇"
            },{
                "id": "2814",
                "name": "岩头镇"
            },{
                "id": "2815",
                "name": "枫林镇"
            },{
                "id": "2816",
                "name": "岩坦镇"
            },{
                "id": "2817",
                "name": "沙头镇"
            },{
                "id": "2818",
                "name": "鹤盛镇"
            },{
                "id": "2819",
                "name": "金溪镇"
            },{
                "id": "2820",
                "name": "云岭乡"
            },{
                "id": "2821",
                "name": "茗岙乡"
            },{
                "id": "2822",
                "name": "溪下乡"
            },{
                "id": "2823",
                "name": "界坑乡"
            },{
                "id": "2824",
                "name": "县特产场场区"
            },{
                "id": "2825",
                "name": "四海山林场"
            },{
                "id": "2826",
                "name": "正江山林场"
            }]
        },
        {
            "id": "29",
            "name": "苍南县",
            "child": [{
                "id": "291",
                "name": "灵溪镇"
            }, {
                "id": "292",
                "name": "龙港镇"
            }, {
                "id": "293",
                "name": "宜山镇"
            }, {
                "id": "294",
                "name": "钱库镇"
            },{
                "id": "295",
                "name": "金乡镇"
            },{
                "id": "296",
                "name": "藻溪镇"
            },{
                "id": "297",
                "name": "桥墩镇"
            },{
                "id": "298",
                "name": "矾山镇"
            },{
                "id": "299",
                "name": "赤溪镇"
            },{
                "id": "2911",
                "name": "马站镇"
            },{
                "id": "2912",
                "name": "望里镇"
            },{
                "id": "2913",
                "name": "炎亭镇"
            },{
                "id": "2914",
                "name": "大渔镇"
            },{
                "id": "2915",
                "name": "莒溪镇"
            },{
                "id": "2916",
                "name": "南宋镇"
            },{
                "id": "2917",
                "name": "霞关镇"
            },{
                "id": "2918",
                "name": "沿浦镇"
            },{
                "id": "2919",
                "name": "岱岭畲族乡"
            },{
                "id": "2920",
                "name": "凤阳畲族乡"
            }]
        },
        {
            "id": "30",
            "name": "平阳县",
            "child": [{
                "id": "301",
                "name": "昆阳镇"
            }, {
                "id": "302",
                "name": "鳌江镇"
            }, {
                "id": "303",
                "name": "水头镇"
            }, {
                "id": "304",
                "name": "萧江镇"
            },{
                "id": "305",
                "name": "腾蛟镇"
            },{
                "id": "306",
                "name": "山门镇"
            },{
                "id": "307",
                "name": "顺溪镇"
            },{
                "id": "308",
                "name": "南雁镇"
            },{
                "id": "309",
                "name": "万全镇"
            },{
                "id": "3011",
                "name": "海西镇"
            },{
                "id": "3012",
                "name": "南麂镇"
            },{
                "id": "3013",
                "name": "麻步镇"
            },{
                "id": "3014",
                "name": "凤卧镇"
            },{
                "id": "3015",
                "name": "怀溪镇"
            },{
                "id": "3016",
                "name": "青街畲族乡"
            },{
                "id": "3017",
                "name": "闹村乡"
            },{
                "id": "3018",
                "name": "滨海新区"
            }]
        },
        {
            "id": "31",
            "name": "文成县",
            "child": [{
                "id": "311",
                "name": "大峃镇"
            }, {
                "id": "312",
                "name": "百丈漈镇"
            }, {
                "id": "313",
                "name": "南田镇"
            }, {
                "id": "314",
                "name": "西坑畲族镇"
            },{
                "id": "315",
                "name": "黄坦镇"
            },{
                "id": "316",
                "name": "珊溪镇"
            },{
                "id": "317",
                "name": "巨屿镇"
            },{
                "id": "318",
                "name": "玉壶镇"
            },{
                "id": "319",
                "name": "峃口镇"
            },{
                "id": "3111",
                "name": "周壤镇"
            },{
                "id": "3112",
                "name": "铜铃山镇"
            },{
                "id": "3113",
                "name": "二源镇"
            },{
                "id": "3114",
                "name": "周山畲族乡"
            },{
                "id": "3115",
                "name": "桂山乡"
            },{
                "id": "3116",
                "name": "双桂乡"
            },{
                "id": "3117",
                "name": "平和乡"
            },{
                "id": "3118",
                "name": "公阳乡"
            }]
        },
        {
            "id": "32",
            "name": "泰顺县",
            "child": [{
                "id": "321",
                "name": "罗阳镇"
            }, {
                "id": "322",
                "name": "司前畲族镇"
            }, {
                "id": "323",
                "name": "百丈镇"
            }, {
                "id": "324",
                "name": "筱村镇"
            },{
                "id": "325",
                "name": "泗溪镇"
            },{
                "id": "326",
                "name": "彭溪镇"
            },{
                "id": "327",
                "name": "雅阳镇"
            },{
                "id": "328",
                "name": "仕阳镇"
            },{
                "id": "329",
                "name": "三魁镇"
            },{
                "id": "3211",
                "name": "南浦溪镇"
            },{
                "id": "3212",
                "name": "龟湖镇"
            },{
                "id": "3213",
                "name": "西旸镇"
            },{
                "id": "3214",
                "name": "竹里畲族乡"
            },{
                "id": "3215",
                "name": "包垟乡"
            },{
                "id": "3216",
                "name": "凤垟乡"
            },{
                "id": "3217",
                "name": "东溪乡"
            },{
                "id": "3218",
                "name": "柳峰乡"
            },{
                "id": "3219",
                "name": "雪溪乡"
            },{
                "id": "3220",
                "name": "大安乡"
            },{
                "id": "3221",
                "name": "乌岩岭自然保护区"
            }]
        },
    ]
}];